Python 3.12.1 (tags/v3.12.1:2305ca5, Dec  7 2023, 22:03:25) [MSC v.1937 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
s1 = {1, 2, 'a', 5}
>>> s2 = set([1, 2, 3, 4, 5, 6])
>>> s2
{1, 2, 3, 4, 5, 6}
>>> s3 = set([4, 5, 6, 7, 8, 9])
>>> s3
{4, 5, 6, 7, 8, 9}
>>> 
>>> # 교집합
>>> s2 & s3
{4, 5, 6}
>>> s2. intersection(s3)
{4, 5, 6}
>>> 
>>> # 합집합
>>> s2 | s3
{1, 2, 3, 4, 5, 6, 7, 8, 9}
>>> s2.union(s3)
{1, 2, 3, 4, 5, 6, 7, 8, 9}
>>> 
>>> # 차집합
>>> s2 - s3
{1, 2, 3}
>>> s2.difference(s3)
{1, 2, 3}
>>> s3.difference(s2)
{8, 9, 7}
>>> 
>>> # 원소 추가
>>> s2.add(7)
>>> s2
{1, 2, 3, 4, 5, 6, 7}
>>> s2.update([6, 7, 8, 9, 10])
>>> s2
{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
>>> 
>>> # 원소 제거
>>> s2.remove(7)
>>> s2
{1, 2, 3, 4, 5, 6, 8, 9, 10}
